1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Создаём метод PrintArray для вывода значений массива
Путем ввода значения, задаём размер массива
Объявляем массив arrayStrings
Циклом for наполняем массив значениями, которые вводим с клавиатуры
Объявляем массив arrayFinal, такой же длины
Объявляем две переменные length и count. length - количество символов в элементе, count - счетчик для определения длины финльного массива
Цикл for выполняется столько раз, сколько элементов в массиве
проверяется условие, если количество символов в элементе массива меньше 



string[] arrayFinal = new string[size];
int length = 3;
int count = 0;

for (int i = 0; i < size; i++)
{
    if (arrayStrings[i].Length <= length)
    {
        arrayFinal[count] = arrayStrings[i];
        count++;
    }
}

Console.WriteLine();
PrintArray(arrayFinal);
